# GetMaximumListStartNumber Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormattedText..::..GetMaximumListStartNumber Method
FormattedText Class See Also
---
Returns the maximum allowed list start number.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public int GetMaximumListStartNumber()
```

Visual Basic
---
```text
Public Function GetMaximumListStartNumber As Integer
```

Visual C++
---
```text
public:
int GetMaximumListStartNumber()
```

# See Also
FormattedText Class
Autodesk.Revit.DB Namespace